/* ১. জাভাস্ক্রিপ্ট কি জিনিস এইটা কি জানো ?
===> জাভাস্ক্রিপ্ট হল একটি ক্লায়েন্ট সাইড স্ক্রিপ্টিং বা ব্রাউজার স্ক্রিপ্টিং ল্যাংগুয়েজ। জাভাস্ক্রিপ্ট (সংক্ষেপে JS বলা হয়) একটি প্রোটোটাইপ-ভিত্তিক স্ক্রিপ্টিং ল্যাংগুয়েজ যাতে পরিবর্তনশীল, দুর্বল টাইপ এবং প্রথম শ্রেণীর ফাংশন আছে। এটি একটি অবজেক্ট ওরিয়েন্টেড, কার্যকরী প্রোগ্রামিং শৈলী সমর্থনকারী ভাষা।

২. জাভাস্ক্রিপ্ট কিভাবে কাজ করে সেটা কি জানো ?
===> জাভাস্ক্রিপ্ট হল একটি ক্লায়েন্ট সাইড স্ক্রিপ্টিং বা ব্রাউজার স্ক্রিপ্টিং ল্যাংগুয়েজ। জাভাস্ক্রিপ্ট (সংক্ষেপে JS বলা হয়) একটি প্রোটোটাইপ-ভিত্তিক স্ক্রিপ্টিং ল্যাংগুয়েজ যাতে পরিবর্তনশীল, দুর্বল টাইপ এবং প্রথম শ্রেণীর ফাংশন আছে। এটি একটি অবজেক্ট ওরিয়েন্টেড, কার্যকরী প্রোগ্রামিং শৈলী সমর্থনকারী ভাষা।

৩. ভেরিয়েবল কি জিনিস ?
===> ভারিএবেল হচ্ছে কোন একটা জিনিস যার ভেলু বা মান পরিবর্তিত বা চেইঞ্জ হইতে পারে এবং তার একটা নাম থাকবে, আপনি যখন ওই নাম ধরে জিজ্ঞেস করবেন আপনাকে তখনকার ভেলুটা দিয়ে দিবে। এই ভেরিএবেল গুলা আবার অনেকগুলা টাইপের হইতে পারে। যেমন সংখ্যা , বর্নের সমষ্টি , তারিখ অথবা হ্যা না টাইপ।

৪. ভেরিয়েবল কিভাবে ডিক্লেয়ার করে  ?
===> ভেরিয়েবল ডিক্লেয়ার করার জন্য ৫ টা জিনিস দরকার, প্রথমে var, let, const পরে ভেরিয়েবলের একটা নাম থাকবে, তারপর = ইকুয়াল দিতে হবে, পরে সেমিকলন, শেষ।।
Exap: let myAge = 18;

৫. ভেরিয়েবল এর মান কিভাবে চেইঞ্জ করে বা আপডেট করে। 
===> ভেরিয়েবল একবার ডিক্লেয়ার করার পর সেটাকে আপডেট করার জন্য জাস্ট পরে নতুন মান দিয়ে দিলেই হবে।
Examp: var myAge = 18;
       myAge = 19;

৬. কি কি ধরণের ভেরিয়েবল হয়। সেগুলা কি কি (হিন্টস: Numeric, String, Boolean)
===> ভেরিইয়েবল ৬ ধরনের হই। 
var bookPrice = 570; numeric
var myName = 'kawsar kabir';  string
var isSingle = true; Boolean
null , undefined, object, function

৭. জাভাস্ক্রিপ এ primitive and non primitive data types কি কি ? উদাহরণ হিসেবে বলো। 
===> জাভাস্ক্রিপ্ট এ ব্যাসিকিলি দুই ধরনের ডাটা টাইপ আছেঃ
১। প্রিমিটিভ ডাটা টাইপ
==> number , string, boolean, undefind , null
২। নন প্রিমিটিভ/রেফারেন্স ডাটা 
==> array, object, fuction

৮. ভেরিয়েবল এর নাম কিভাবে কিভাবে ডিক্লেয়ার করতে হয়। কোন কোন জিনিস নাম এ লেখা যাবে না। অর্থাৎ Variable এর naming convention সম্পর্কে বলো। 
===> i) জাভাস্ক্রিপ্ট এর রিসার্ভড কীওয়ার্ড ইউজ করতে পারবেন না।
ii) হতে z অথবা A হতে Z পর্যন্ত যেকোন বর্ন ব্যবহার করা যাবে
iii) ২। ভ্যারিয়েবলের নাম অক্ষর দিয়ে শুরু হতে পারবে, তবে নাম্বার,স্পেশাল ক্যারেক্টার !, @, #, %, ^, &, *, (, ) দিয়ে শুরু হতে পারবে না।কিন্তু ‘_’(আন্ডারস্কোর) ও ‘$’ (ডলার সাইন) ইউজ করে শুরু করতে পারবেন।
iv) ভ্যারিয়েবলের নামের মাঝখানে স্পেস ইউজ করা যাবে না। 
ভ্যারিয়েবলের নামের মাঝখানে স্পেস ইউজ করা যাবে না। 
v) জাভাস্ক্রিপ্ট এ ভ্যারিয়েবল এর নাম কেস-সেনসিটিভ। মানে myName এবং Myname বা myname এক না।
vi) ক্যামেলকেস ফরম্যাট: জাভাস্ক্রিপ্ট ডেভেলপার কমিউনিটিতে বেশী ইউজ হয়। 


৯. দুইটা ভেরিয়েবল এর মধ্যে +, -, *, /, % কিভাবে করে? 
===> var x = 10;
var y = 5;
sum = x + y;
sum = x - y;
sum = x * y;
sum = x / y;
sum = x % y;
console.log(sum);


১০. শর্টহ্যান্ড গুলো জানতে হবে। বিশেষ করে +=, -=, *=, /= জানতে হবে। 
+= এটা দ্বারা বোঝয় ভেরিয়বলের কারেন্ট ভেলুর সাথে  নতুন মান যোগ করা।
-= এটা দ্বারা বোঝয় ভেরিয়বলের কারেন্ট ভেলুর সাথে  নতুন মান বিযোগ করা।
*= এটা দ্বারা বোঝয় ভেরিয়বলের কারেন্ট ভেলুর সাথে  নতুন মান গুণ করা।
/= এটা দ্বারা বোঝয় ভেরিয়বলের কারেন্ট ভেলুর সাথে  নতুন মান ভাগ করা।

১১.. ++ এবং -- এর কাজ কি ? এইটা কি জানো।  
===> ++ এর মানে হলো ১ , ১ করে বাড়তে থাকবে আর -- এর মানে হলো  ১ , ১ করে মান কমতে থাকবে।

১২ parseInt, parseFloat, toFixed এইগুলা কি করে? 
===> parseInt ইন্টিজারে কনভার্ট করে দেয়, parseFloat ভগ্নাংশে প্রকাশ করে দেয়, toFixed float নাম্বারে লাস্টে কত ঘর রাখতে চায় সেটা বলে দিতে পারবো।
---------------------------------------------------------------------------------------------


১৩. Array কি জিনিস। এইটা কিভাবে কাজ করে? কিভাবে Array ডিক্লেয়ার করতে হয় 
===> অ্যারে (array) হল একই টাইপের একাধিক ভেরিয়েবল এর সংগ্রহ যা মেমরির কাছাকাছি লোকেশনে ডাটা স্টোর করে। অ্যারে ডিক্লেয়ার করার জন্য প্রথমে একটা নাম দিতে হবে তারপর = সমান দিয়ে [] ব্রাকেটের মধ্যে , কমা দিয়ে দিয়ে একটা একটা উপাদান দিতে হবে। লাস্টে ; দিয়ে শেষ করতে হবে । 

১৪. array এর মধ্যে কয়টা উপাদান (element) আছে সেটা কিভাবে বের করে  ?
===> .length দিয়ে বের করা যায় যেমনঃ
var arrayName = [1, 2, 3, 4, 5, 6];
console.log(arrayName.length);

১৫. array এর উপাদান গুলা এর পজিশন ( index) কিভাবে কাজ করে। কত দিয়ে শুরু হয়। এবং মান কিভাবে চেইঞ্জ হয়। 
===> ০ থেকে শুরু হয়ে এক এক করে বাড়তে থেকে ।

১৬. কোন একটা উপাদানের index এর মান -১ বলতে কি বুঝায়  ?
===> -১ দ্বারা বোঝয় ওই উপাদানটা আমাদের অ্যারের মধ্যে নাই।

১৭. কিভাবে index দিয়ে কোন একটা array এর মধ্যে উপাদান এর মান খুঁজে বের করতে পারো  ?
===> var arrayName = [1, 2, 3, 4, 5, 6];
console.log(arrayName[0]);

১৮. কিভাবে কোন একটা index পজিশন এ array এর উপাদান এর মান চেইঞ্জ করতে পারবে  ?
===> var arrayName = [1, 2, 3, 4, 5, 6];
arrayName[3] = 10; 
console.log(arrayName);

১৯. একটা Array এর মধ্যে কোন একটা উপাদান এর মান তোমাকে দেয়া আছে এখন সেটার index তুমি কিভাবে খুঁজে বের করতে পারো? 
===> var arrayName = [1, 2, 3, 4, 5, 6];
console.log(arrayName.indexOf(4));

২০. ধরো, কোন একটা ইনডেক্স দিয়ে উপাদান খুঁজতে গেছো। কিন্তু সেটার মান না দিয়ে তোমাকে undefined দেখাচ্ছে। সেটা দেখে তুমি কি বুঝবে? (একটু গুগলে সার্চ দাও। আমরা কোর্স এ এইটা আলোচনা করিনি। তারপরেও চেষ্টা করে দেখো)

২১. কোন একটা Array এর মধ্যে লাস্ট উপাদান হিসেবে কোন উপাদান হিসেবে যোগ করতে চাইলে কিভাৱে যোগ করবে। আবার Array থেকে শেষের উপাদান টা বের করে দিতে চাইলে কিভাবে বের করে দিবে  ?
===> var arrayName = [1, 2, 3, 4, 5, 6];
console.log(arrayName.push(7)); // 
console.log(arrayName.pop());
console.log(arrayName);


২২. কোন একটা Array এর মধ্যে প্রথম উপাদান হিসেবে কোন উপাদান হিসেবে যোগ করতে চাইলে কিভাৱে যোগ করবে। আবার Array থেকে প্রথম উপাদান টা বের করে দিতে চাইলে কিভাবে বের করে দিবে  ?
====> shift and unshift দিয়ে করা যায় যেমন ঃ 
var arrayName = [1, 2, 3, 4, 5, 6];
console.log(arrayName.unshift(7));
console.log(arrayName.shift());
console.log(arrayName);


২৩. তুলনা কিভাবে করতে হয়। এইগুলার মানে কি: >, <, ==, !=, <=, >=, ===, !==, &&, ।। 
===> 


২৪. তোমার কাছে: ৮০০০০ টাকার বেশি হলে তুমি mac কিনবে, ৬০ টাকার বেশি হলে gaming ল্যাপটপ কিনবে, ৪০ হাজার টাকার বেশি হলে lenovo yoga কম্পিউটার কিনবে , ২০ হাজার টাকার বেশি হলে পুরান ল্যাপটপ কিনবে। না হয় তুমি মোবাইল দিয়ে কাজ চালাবে। 
===> var myMoney = 50000;
if( myMoney > 80000){
    console.log(' i wil buy mac');
}
else if( myMoney > 60000){
    console.log('i will buy gamming laptop');
}
else if( myMoney > 40000){
    console.log('i will buy lenovo yoga computer');
}
else if( myMoney > 20000){
    console.log(' i will buy odl laptop');
}
else{
    console.log('phone diyei hoye jabe ');
}


---------------------

২৫. আসকে আমার মন ভালো নেই -- এই কথা ৩৯ বার আউটপুট হিসেবে দেখাও। 
===> for(var i = 1; i<=39 ; i++){
    console.log('Today My Mood Of');
}


২৬. while লুপ কিভাবে কাজ করে   ?

২৭. for লুপ কিভাবে কাজ করে 

২৮. while লুপ এর মধ্যে লুপ ভেরিয়েবল চেইঞ্জ না করলে কি সমস্যা হয়  ?
===> লুপ ইনফিনিটি হয়ে যাবে 😀

২৯. একটা কোড লিখে ৫৮ থেকে ৯৮ পর্যন্ত যত সংখ্যা আছে সেগুলাকে দেখাও 
===>  for(var i = 58; i<=98 ; i++){
    console.log(i);
}

৩০.একটা কোড লিখে ৪১২ থেকে ৪৫৬ পর্যন্ত যত জোর সংখ্যা আছে সেগুলাকে দেখাও।
===> for(var i = 412; i<=456 ; i+=2){
    console.log(i);
}

৩১. একটা কোড লিখে ৫৮১ থেকে ৬২৩ পর্যন্ত যত বিজোড় সংখ্যা আছে সেগুলাকে দেখাও ।
===> for(var i = 581; i<=623 ; i+=2){
    console.log(i);
}

৩২.while আর for loop এর মধ্যে পার্থক্য কি   ?
===>  "while" loop is used when you do not know the number of iterations beforehand, while "for" loop is used when you know the exact number of iterations.


৩৩ তুমি এতদিন যা যা জিনিস শিখছো সেগুলার নাম দিয়ে একটা array বানাও। তারপর একটা for লুপ দিয়ে সেই array এর সব উপাদান কে আউটপুট হিসেবে দেখাও। 

৩৪. তুমি এতদিন পর্যন্ত যে যে মডেলের মোবাইল ফোন ইউজ করেছো সেগুলার নাম দিয়ে একটা array বানাও। তারপর একটা while লুপ দিয়ে সেই array এর উপাদান গুলা একটা একটা করে আউটপুট হিসেবে দেখাও 

৩৫. একটা ফর লুপ চালাও। ৩০ থেকে ৮৬ পর্যন্ত। আর এই লুপ ৪৪ এ গেলে ব্রেক করবে। সেই জিনিস কোড করে দেখাও 

৩৬. তোমার যত বই আছে সেগুলার দাম নিয়ে একটা array লিখে ফেলো। যে বই গুলোর দাম ২০০ টাকার উপরে সেগুলাকে স্কিপ করবে। অর্থাৎ সেগুলাকে আউটপুট হিসেবে দেখাবে না। বাকিদের কে আউটপুট হিসেবে দেখাবে। দেখো করতে পারো কিনা। 
 */